---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
PerformanceAdviser..::..WillRuleCheckElements Method
PerformanceAdviser Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | WillRuleCheckElements(Int32) | Reports if rule needs to be executed on individual elements. |
|  | WillRuleCheckElements(PerformanceAdviserRuleId) | Reports if rule needs to be executed on individual elements. |

# See Also

PerformanceAdviser Class

PerformanceAdviser Members

Autodesk.Revit.DB Namespace